package Experiments;

public class Type_of_data {
    /*boolean: хранит значение true или false*/
    boolean isActive = false;
    boolean isAlive = true;

    /*byte: хранит целое число от -128 до 127 и занимает 1 байт*/
    byte a = 3;
    byte b = 8;

    /*short: хранит целое число от -32768 до 32767 и занимает 2 байта*/
    short c = 3;
    short d = 8;

    /*int: хранит целое число от -2147483648 до 2147483647 и занимает 4 байта*/
    int e = 4;
    int f = 9;

    /*long: хранит целое число от –9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 и занимает 8 байт*/
    long g = 5;
    long h = 10;

    /*double: хранит число с плавающей точкой от ±4.9*10-324 до ±1.7976931348623157*10308 и занимает 8 байт*/
    double i = 8.5;
    double j = 2.7;
    //В качестве разделителя целой и дробной части в дробных литералах используется точка.

    /*float: хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта*/
    float k = 8.5F;
    float l = 2.7F;
    //byte, short, int, long, float, double, boolean и char это примитивные типы данных
    /*char: хранит одиночный символ в кодировке UTF-16 и занимает 2 байта, поэтому диапазон хранимых значений от 0 до 65535*/
}
